export const questionList = [
  {
    question: [
      '큰 수술을 받고 입원해서 지쳐있는 상태이다. 친구들이 말없이 우르르 병문안을 와주었다.',
    ],
    answer: [
      { type: 'E', text: '피곤하지만 마침 심심했는데 잘됐다!!' },
      { type: 'I', text: '아.. 고마운데 혼자서 쉬고 싶은데... 나 피곤훼...' },
    ],
  },
  {
    question: ['해저터널을 지나고 있다. 어떤 생각이 드는가?'],
    answer: [
      { type: 'S', text: '와 기술 좋다' },
      {
        type: 'N',
        text: '해저터널에 구멍 뚫리면 어쩌지..? 이대로 익사하는 건가..? 빨리 달려서 이 터널을 나갔으면 좋겠다.',
      },
    ],
  },
  {
    question: [
      '마트 시식코너에서 시식을 했다. 직원분이 이번에 나온 상품이 2+1이라고 권유를 하지만 딱히 내 입맛은 아니다.',
    ],
    answer: [
      { type: 'T', text: '아 괜찮습니다 ^^ (진짜 괜찮음)' },
      {
        type: 'F',
        text: '좀 더 둘러보고 올게요 ~ ^^ (다시 안감) (마음이 안 좋음)',
      },
    ],
  },
  {
    question: ['가려던 맛집이 공지도 없이 휴무다.'],
    answer: [
      {
        type: 'J',
        text: '플랜 B로 가자. 같은 일이 생기기 전에 가기 전에 미리 전화해본다.',
      },
      {
        type: 'P',
        text: '주변에 돌아보면서 마음이 끌리는 곳으로 간다.',
      },
    ],
  },
  {
    question: [
      '알 수 없는 치사율 100%인 바이러스를 발견했다는 찌라시를 봤다. 무슨 생각이 드는가?',
    ],
    answer: [
      {
        type: 'N',
        text: '온종일 그 바이러스 생각만 한다.',
      },
      {
        type: 'S',
        text: '아 그렇구나 뉴스에 떴나? 찾아봐야겠다.',
      },
    ],
  },
  {
    question: [
      '집으로 돌아와 휴식을 취하려고 누웠는데 오늘 할 일을 다 못한 것이 생각났다.',
    ],
    answer: [
      {
        type: 'P',
        text: '침대에 곧바로 누워 휴식을 취한다.',
      },
      {
        type: 'J',
        text: '오늘 이걸 꼭 해야 했는데.. 내내 마음이 불편하다.',
      },
    ],
  },
  {
    question: [
      '공연장에 혼자 갔다. 좌석에 앉아 대기하는데 옆 사람도 혼자 온 것 같다.',
    ],
    answer: [
      {
        type: 'I',
        text: '나만 혼자 온 게 아니구나... 다행이당...',
      },
      {
        type: 'E',
        text: '바로 말을 건다. “안녕하세요? 혼자 오셨어요?”',
      },
    ],
  },
  {
    question: ['친구가 차 사고가 났다고 나에게 얘기함.'],
    answer: [
      {
        type: 'F',
        text: '친구가 괜찮은지 걱정 (무슨 일이야!!!! 안 다쳤어??ㅠ)',
      },
      {
        type: 'T',
        text: '어떤 상황인지 파악 (괜찮아? 어쩌다 난 사고야?)',
      },
    ],
  },
  {
    question: ['갑자기 다음 주에 쪽지 시험을 친다는 교수님.'],
    answer: [
      {
        type: 'J',
        text: '시험 범위 나누기 남은 날 공부법 간다.',
      },
      {
        type: 'P',
        text: '공부해야 하는데....(5일 뒤) 밤을 새운다.',
      },
    ],
  },
  {
    question: [
      '친구가 만약 자고 일어났을 때 중력이 모두 사라져 있으면 어떨 것 같으냐고 물어볼 때 내 반응은?',
    ],
    answer: [
      {
        type: 'S',
        text: '이걸 왜하는 거야?',
      },
      {
        type: 'N',
        text: '머릿속에 상황이 그려지면서 진지하게 고민한다.',
      },
    ],
  },
  {
    question: [
      '열심히 만든 프로젝트를 발표했다. 선배가 피드백을 여러 개 줬다. 나의 심정은?',
    ],
    answer: [
      {
        type: 'T',
        text: '논리가 타당하다면 그대로 수용한다.',
      },
      {
        type: 'F',
        text: '일단 피드백을 받았다는 사실에 슬퍼진다. 나는 멍청이야 ㅠㅠ',
      },
    ],
  },
  {
    question: [
      '자리가 몇 자리 없는 맛집에 혼자 갔다. 오래 기다렸는데 다른 사람들과 합석을 해야만 먹을 수 있다.',
    ],
    answer: [
      {
        type: 'E',
        text: '앗싸 혼자 심심하게 먹지 않아도 된다! 하며 엉덩이를 붙인다.',
      },
      {
        type: 'I',
        text: '다른 사람과의 겸상..? 생각만 해도 부담스럽. 바로 줄행랑을 친다.',
      },
    ],
  },
];
